# SQL & NOSQL

SQL and NoSQL are two types of database management systems (DBMS) that are used to store and manage data.

SQL (Structured Query Language) is a relational database management system (RDBMS) that is widely used in the industry. It provides a set of standardized commands to interact with databases and is known for its ability to handle complex queries and transactions. SQL databases are organized into tables with predefined schemas, and data is stored in rows and columns. This type of database is best suited for applications that require structured data with fixed schemas, such as finance or banking applications.  

On the other hand, NoSQL (Not Only SQL) is a non-relational database management system that is used to handle large volumes of unstructured or semi-structured data. It allows for flexible schema designs and can handle data that is not easily structured into tables, rows, and columns. NoSQL databases are designed to be scalable and fault-tolerant, making them ideal for use cases such as big data analytics, social media platforms, and IoT (Internet of Things) applications.  

In summary, SQL databases are best suited for applications that require structured data and complex queries, while NoSQL databases are ideal for applications that require scalability and flexible schema designs for handling large volumes of unstructured or semi-structured data.

# SQL

SQL (Structured Query Language) is a standard language used to communicate with relational databases. It is used to create, manage and manipulate relational databases. SQL provides a powerful and flexible way to manage data in tables, columns and rows, and enables users to access and modify data with a set of commands.

SQL is used to perform various operations on the data stored in a relational database, such as adding, deleting and modifying records. It is also used to retrieve data from multiple tables using various SQL join operations, and to perform calculations and transformations on the data using various SQL functions.

SQL has a simple and easy-to-learn syntax, and it is used by millions of developers and database administrators worldwide. SQL commands are usually executed using a database management system (DBMS) such as MySQL, Oracle, SQL Server, PostgreSQL, and many others.

Some of the most common SQL commands include SELECT, INSERT, UPDATE, DELETE, CREATE, DROP, ALTER, and INDEX. These commands are used to perform various operations on the data in a relational database. For example, SELECT is used to retrieve data from one or more tables, INSERT is used to add new records to a table, UPDATE is used to modify existing records, and DELETE is used to remove records from a table.

Overall, SQL is an essential tool for managing and manipulating data in a relational database.

### SQL Commands

Here are some common SQL commands and their explanations:

SELECT: The SELECT statement is used to retrieve data from one or more tables in a database. It specifies which columns to return, and may also contain clauses to filter, group, and sort the results. For example, SELECT column1, column2 FROM table1 would return the values in columns 1 and 2 of the table named "table1".

INSERT: The INSERT statement is used to add new rows of data to a table. It specifies the table name, the column names, and the values to be inserted. For example, INSERT INTO table1 (column1, column2) VALUES (value1, value2) would insert a new row into "table1" with the values "value1" in column1 and "value2" in column2.

UPDATE: The UPDATE statement is used to modify existing data in a table. It specifies the table name, the column to be updated, and the new value to be set. It may also contain a WHERE clause to specify which rows to update. For example, UPDATE table1 SET column1 = value1 WHERE column2 = value2 would update the value in column1 of "table1" to "value1" where the value in column2 is "value2".

DELETE: The DELETE statement is used to remove rows from a table. It specifies the table name, and may contain a WHERE clause to specify which rows to delete. For example, DELETE FROM table1 WHERE column1 = value1 would delete all rows from "table1" where the value in column1 is "value1".

CREATE: The CREATE statement is used to create new tables, indexes, and other database objects. It specifies the object type, name, and any columns or properties that are required. For example, CREATE TABLE table1 (column1 datatype1, column2 datatype2) would create a new table named "table1" with two columns and their respective data types.

ALTER: The ALTER statement is used to modify the structure of existing tables or other database objects. It may be used to add or remove columns, change data types, or modify other properties. For example, ALTER TABLE table1 ADD column3 datatype3 would add a new column named "column3" with data type "datatype3" to the "table1" table.

DROP: The DROP statement is used to remove tables, indexes, and other database objects. It specifies the object name and type. For example, DROP TABLE table1 would remove the "table1" table from the database.

TRUNCATE: The TRUNCATE statement is used to remove all rows from a table, while preserving its structure. It is similar to DELETE, but is more efficient for large tables. For example, TRUNCATE TABLE table1 would remove all rows from "table1" but leave the table structure intact.

| Language | Command              | Uses                                                                                                                                              | Command prompt                                   |
|----------|----------------------|---------------------------------------------------------------------------------------------------------------------------------------------------|--------------------------------------------------|
| TCL      | COMMIT               | Saves all changes made since the last COMMIT or ROLLBACK command was issued.                                                                       | COMMIT;                                          |
| TCL      | ROLLBACK             | Reverts all changes made since the last COMMIT or ROLLBACK command was issued.                                                                     | ROLLBACK;                                        |
| TCL      | SAVEPOINT            | Creates a savepoint, which allows you to roll back part of a transaction without affecting the entire transaction.                                | SAVEPOINT savepoint;                              |
| TCL      | RELEASE              | Ends a savepoint created by the SAVEPOINT command.                                                                                                 | RELEASE savepoint;                                |
| DML      | SELECT               | Retrieves data from one or more tables.                                                                                                           | SELECT * FROM table;                              |
| DML      | INSERT               | Inserts data into a table.                                                                                                                        | INSERT INTO table (column1, column2) VALUES (value1, value2); |
| DML      | UPDATE               | Modifies data in a table.                                                                                                                         | UPDATE table SET column1 = value1 WHERE condition; |
| DML      | DELETE               | Deletes data from a table.                                                                                                                        | DELETE FROM table WHERE condition;                |
| DCL      | GRANT                | Grants a user or role permission to perform a specific action on a database object.                                                                | GRANT permission ON object TO user;               |
| DCL      | REVOKE               | Revokes a permission that was previously granted to a user or role.                                                                                | REVOKE permission ON object FROM user;            |
| DDL      | CREATE TABLE         | Creates a new table in a database.                                                                                                                 | CREATE TABLE table (column1 datatype1, column2 datatype2, ...); |
| DDL      | ALTER TABLE          | Modifies an existing table in a database.                                                                                                          | ALTER TABLE table ADD column datatype;           |
| DDL      | DROP TABLE           | Deletes a table and its data from a database.                                                                                                      | DROP TABLE table;                                 |
| DDL      | CREATE INDEX         | Creates an index on one or more columns of a table.                                                                                                 | CREATE INDEX index_name ON table(column1, column2); |
| DDL      | ALTER INDEX          | Modifies an existing index in a database.                                                                                                          | ALTER INDEX index_name RENAME TO new_index_name;  |
| DDL      | DROP INDEX           | Deletes an index from a database.                                                                                                                  | DROP INDEX index_name;                            |
| DDL      | CREATE VIEW          | Creates a virtual table that presents data from one or more tables in a different format.                                                           | CREATE VIEW view_name AS SELECT column1, column2 FROM table WHERE condition; |
| DDL      | ALTER VIEW           | Modifies an existing view in a database.                                                                                                           | ALTER VIEW view_name AS SELECT column1, column2 FROM table WHERE condition; |
| DDL      | DROP VIEW            | Deletes a view from a database.                                                                                                                    | DROP VIEW view_name;                              |
| DDL      | CREATE PROCEDURE     | Creates a stored procedure in a database.                                                                                                          | CREATE PROCEDURE procedure_name (parameter1, parameter2, ...) BEGIN ... END; |
| DDL      | ALTER PROCEDURE      | Modifies an existing stored procedure in a database.                                                                                               | ALTER PROCEDURE procedure_name (parameter1, parameter2, ...) BEGIN ... END; |
| DDL      | DROP PROCEDURE       | Deletes a stored procedure from a database.                                                                                                        | DROP PROCEDURE procedure_name;                    |
|

### TCL, DML, DCL, and DDL are four types of languages used in relational databases like SQL.

Transaction Control Language (TCL):
TCL (Transaction Control Language) commands are used to manage transactions in a database. A transaction is a set of SQL statements that are executed as a single unit. TCL is responsible for the management of transactions by using the COMMIT, ROLLBACK, and SAVEPOINT commands.    

COMMIT: It is used to save all changes made since the last COMMIT or ROLLBACK command was issued. COMMIT makes the changes permanent.  
ROLLBACK: It is used to undo all the changes made since the last COMMIT or ROLLBACK command was issued. ROLLBACK undoes the changes made to the database.  
SAVEPOINT: It is used to create a savepoint in a transaction. A savepoint is a point in a transaction where you can roll back to without affecting the entire transaction.  
RELEASE: It is used to release a savepoint created using the SAVEPOINT command.  


Data Manipulation Language (DML):  
DML (Data Manipulation Language) commands are used to manipulate data in a database. The four basic DML commands are SELECT, INSERT, UPDATE, and DELETE.  
SELECT: It is used to retrieve data from one or more tables in a database. SELECT statements are used to query the database and retrieve data from it.    
INSERT: It is used to insert data into a table in a database. INSERT statements are used to add new data to a table.
UPDATE: It is used to modify existing data in a table. UPDATE statements are used to change data that is already in a table.  
DELETE: It is used to delete data from a table. DELETE statements are used to remove data from a table.    


Data Control Language (DCL):
DCL (Data Control Language) commands are used to control access to data in a database. The two main DCL commands are GRANT and REVOKE.  
GRANT: It is used to grant a user or role permission to perform a specific action on a database object. For example, a user can be granted SELECT permission on a table, which allows them to retrieve data from the table.  
REVOKE: It is used to revoke a permission that was previously granted to a user or role. For example, a user can be revoked SELECT permission on a table, which would prevent them from retrieving data from the table.     


Data Definition Language (DDL): 
DDL (Data Definition Language) commands are used to define the structure of a database. The three basic DDL commands are CREATE, ALTER, and DROP.  
CREATE: It is used to create a new database object, such as a table, index, or view.  
ALTER: It is used to modify the structure of an existing database object, such as a table or view.  
DROP: It is used to delete an existing database object, such as a table or view.  
Overall, TCL, DML, DCL, and DDL are all important languages in SQL that allow for effective management, manipulation, control, and definition of data in a relational database.

### Joins

Joins in SQL are used to combine rows from two or more tables based on a related column between them. The related column is referred to as the join condition. There are different types of joins available in SQL, including INNER JOIN, LEFT JOIN, RIGHT JOIN, and FULL OUTER JOIN.

| Join type | Syntax                                            | Description                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            |
|-----------|---------------------------------------------------|----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| INNER     | SELECT column_name(s) FROM table1 INNER JOIN table2 ON table1.column_name = table2.column_name; | Returns only the rows that have matching values in both tables involved in the join.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   |
| LEFT      | SELECT column_name(s) FROM table1 LEFT JOIN table2 ON table1.column_name = table2.column_name;  | Returns all the rows from the left table (table1), and the matched rows from the right table (table2). The result is NULL from the right side, if there is no match.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            |
| RIGHT     | SELECT column_name(s) FROM table1 RIGHT JOIN table2 ON table1.column_name = table2.column_name; | Returns all the rows from the right table (table2), and the matched rows from the left table (table1). The result is NULL from the left side, when there is no match.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            |
| FULL      | SELECT column_name(s) FROM table1 FULL OUTER JOIN table2 ON table1.column_name = table2.column_name; | Returns all the rows from both tables involved in the join. The result is NULL from both the left and right sides, when there is no match.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
| CROSS     | SELECT column_name(s) FROM table1 CROSS JOIN table2; | Returns the Cartesian product of the two tables involved in the join. It means every row from the first table is combined with every row from the second table, resulting in all possible combinations. It does not require any condition to join the tables.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       |

### Procedures and Functions

Procedures and functions are two types of database objects in SQL that can be created and executed to perform specific tasks or calculations.

A procedure is a collection of SQL statements that are stored in the database and can be executed whenever needed. Procedures are typically used to perform repetitive tasks or to encapsulate complex queries into a single unit that can be called from other parts of the application. Procedures can also be used to enforce business rules or security measures.

A function, on the other hand, is a specific type of procedure that returns a value. Functions can be used to perform calculations or lookups and return a result that can be used in other parts of the query or application. Functions can be called from other SQL statements or within other functions or procedures.

To create a procedure or function in SQL, you can use the CREATE PROCEDURE or CREATE FUNCTION statement, followed by the name of the procedure or function and the SQL code that defines the behavior of the object. Once the procedure or function is created, it can be executed using the EXECUTE statement or by calling it from other SQL code.

Here's an example of a stored procedure that retrieves all the orders for a given customer ID:

CREATE PROCEDURE GetCustomerOrders  
    @CustomerID int  
AS  
BEGIN  
    SELECT * FROM Orders  
    WHERE CustomerID = @CustomerID  
END

And here's an example of a stored function that calculates the total cost of an order:

CREATE FUNCTION CalculateOrderTotal  
      (@OrderID int)  
RETURNS money  
AS   
BEGIN  
     DECLARE @Total money  
     SELECT @Total = SUM(UnitPrice * Quantity)  
     FROM OrderDetails  
     WHERE OrderID = @OrderID  
     RETURN @Total  
END

## Keys

In SQL (Structured Query Language), a key is a field or combination of fields that uniquely identifies a record in a database table. There are several types of keys used in SQL, including:

Primary Key: A primary key is a column or set of columns that uniquely identifies each row in a table. Primary keys cannot contain null values, and each table can have only one primary key.  

Foreign Key: A foreign key is a column or set of columns that refers to the primary key of another table. It is used to establish a link between two tables in a relational database.  

Candidate Key: A candidate key is a column or set of columns that can be used as a primary key for a table. There can be multiple candidate keys in a table.  

Unique Key: A unique key is a column or set of columns that have a unique value for each row in a table. It is similar to a primary key, but a table can have multiple unique keys.  

Composite Key: A composite key is a key that consists of multiple columns that together uniquely identify a record in a table.  

Keys are important in SQL because they help ensure data integrity and accuracy. They prevent duplicate records and ensure that each record can be uniquely identified. In addition, keys are used to establish relationships between tables in a database.

## Views

In SQL (Structured Query Language), a view is a virtual table that is created based on the result of a SELECT query. Unlike physical tables, views do not contain data themselves; instead, they provide a way to access data from one or more tables in a structured manner.

Views are useful in several ways:

Simplify Complex Queries: Views allow you to simplify complex queries by breaking them down into smaller, more manageable pieces. Instead of writing a complex query each time you need to access certain data, you can create a view that contains the required data and use it as a simple query.

Restrict Data Access: Views can also be used to restrict data access to certain users or groups. For example, you can create a view that contains only the columns that a particular user is authorized to access, and grant that user permission to access the view.

Combine Data: Views can be used to combine data from multiple tables into a single virtual table. This can be useful when you need to retrieve data from multiple tables, but don't want to write a complex query that joins them all together.

Improve Performance: Views can improve query performance by reducing the amount of data that needs to be retrieved from the underlying tables. By creating views that contain only the required data, you can reduce the amount of data that needs to be transferred across the network and processed by the database server.

Overall, views provide a way to simplify queries, control data access, combine data from multiple tables, and improve performance. They are a powerful tool in SQL that can help you work more efficiently with your data.

### Conditional Statements

| Command            | Description                                                                                                                     | Example                                                           |
|--------------------|---------------------------------------------------------------------------------------------------------------------------------|-------------------------------------------------------------------|
| IF                 | Executes the statement if the condition is true.                                                                                | IF x > 5 THEN SELECT * FROM table1; END IF;                      |
| IF-ELSE            | Executes statement1 if the condition is true, and statement2 if the condition is false.                                        | IF x > 5 THEN SELECT * FROM table1; ELSE SELECT * FROM table2; END IF; |
| IF-ELSEIF-ELSE     | Executes statement1 if condition1 is true, statement2 if condition2 is true, and statement3 if all conditions are false. | IF x > 5 THEN SELECT * FROM table1; ELSEIF x < 3 THEN SELECT * FROM table2; ELSE SELECT * FROM table3; END IF; |
| CASE               | Evaluates a series of conditions and returns a result based on the first condition that is true.                                 | CASE WHEN x > 5 THEN 'Greater than 5' WHEN x = 5 THEN 'Equal to 5' ELSE 'Less than 5' END; |
| NULLIF             | Compares two expressions and returns NULL if they are equal, or the first expression if they are not equal.                     | SELECT NULLIF(5, 5); -- returns NULL |
| COALESCE           | Returns the first non-null expression in a list of expressions.                                                                  | SELECT COALESCE(NULL, 0, 1); -- returns 0 |
| EXISTS             | Checks whether a subquery returns any rows, and returns true or false based on the result.                                      | SELECT * FROM table1 WHERE EXISTS (SELECT * FROM table2 WHERE table2.col = table1.col); |
| WHERE              | Filters the rows returned by a SELECT statement based on a specified condition.                                                 | SELECT * FROM table1 WHERE col1 = 'value'; |
| ORDER BY           | Sorts the rows returned by a SELECT statement based on one or more columns.                                                      | SELECT * FROM table1 ORDER BY col1 ASC; |
| GROUP BY           | Groups the rows returned by a SELECT statement based on one or more columns, and allows you to perform aggregate functions (such as SUM or AVG) on each group. | SELECT col1, SUM(col2) FROM table1 GROUP BY col1; |
| HAVING             | Filters the groups returned by a SELECT statement based on a specified condition.                                               | SELECT col1, SUM(col2) FROM table1 GROUP BY col1 HAVING SUM(col2) > 100; |
| JOIN               | Combines two or more tables based on a specified condition.                                                                     | SELECT * FROM table1 JOIN table2 ON table1.col = table2.col; |
| UNION              | Combines the results of two or more SELECT statements into a single result set.                                                  | SELECT col1 FROM table1 UNION SELECT col2 FROM table2; |
| INSERT INTO        | Adds one or more rows to a table.                                                                                                | INSERT INTO table1 (col1, col2) VALUES ('value1', 'value2'); |
| UPDATE             | Modifies one or more rows in a table.                                                                                            | UPDATE table1 SET col1 = 'value1' WHERE col2 = 'value2'; |
| DELETE FROM        | Removes one or more rows from a table.                                                                                           | DELETE FROM table1 WHERE col1 = 'value'; |

In [3]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\inare\anaconda3\lib\site-packages (8.0.29)Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: protobuf>=3.0.0 in c:\users\inare\anaconda3\lib\site-packages (from mysql-connector-python) (4.22.0)

In [4]:
pip install faker

Requirement already satisfied: faker in c:\users\inare\anaconda3\lib\site-packages (17.6.0)
Requirement already satisfied: python-dateutil>=2.4 in c:\users\inare\anaconda3\lib\site-packages (from faker) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\inare\anaconda3\lib\site-packages (from python-dateutil>=2.4->faker) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [5]:
import random
from faker import Faker
import mysql.connector

# Connect to the database
db = mysql.connector.connect(
    host="localhost",
    user="root",
    password="12345",
    database="matta"
)

# Create a cursor
cursor = db.cursor()

# Drop the students_data table if it exists
cursor.execute("DROP TABLE IF EXISTS students_data")

# Create the students_data table
cursor.execute("""
CREATE TABLE students_data (
    id INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
    student_id VARCHAR(255) UNIQUE,
    name VARCHAR(255),
    age INT,
    gender VARCHAR(255),
    city VARCHAR(255),
    country VARCHAR(255),
    degree VARCHAR(255),
    specialisation VARCHAR(255),
    special_classes VARCHAR(255),
    grade FLOAT
)
""")

# Function to insert student data into the database
def insert_student_data(num_rows):
    fake = Faker()
    for i in range(num_rows):
        student_id = 'S' + str(random.randint(10000, 99999))
        while True:
            # Check if the generated student ID already exists in the database
            cursor.execute("SELECT student_id FROM students_data WHERE student_id = %s", (student_id,))
            result = cursor.fetchone()
            if result is None:
                # If the student ID does not exist, break out of the loop
                break
            # If the student ID already exists, generate a new one
            student_id = 'S' + str(random.randint(10000, 99999))
        name = fake.name()
        age = random.randint(18, 25)
        gender = random.choice(['Male', 'Female'])
        city = fake.city()
        country = fake.country().replace("'", "''")
        degree = random.choice(['Bachelor of Science', 'Bachelor of Arts', 'Bachelor of Commerce'])
        specialisation = random.choice(['Computer Science', 'Marketing', 'Accounting','HR','Digital Marketing'])
        special_classes = random.choice(['Yes', 'No'])
        grade = round(random.uniform(0.0, 4.0), 2)
        query = "INSERT INTO students_data (student_id, name, age, gender, city, country, degree, specialisation, special_classes, grade) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s,%s)"
        values = (student_id, name, age, gender, city, country, degree, specialisation, special_classes, grade)
        cursor.execute(query, values)

# Get user input for number of rows to insert
num_rows = int(input("Enter the number of rows of student data to insert: "))

# Insert student data in batches of 1000 rows at a time
num_iterations = num_rows // 100000
if num_rows % 100000 != 0:
    num_iterations += 1

index = 1
for i in range(num_iterations):
    insert_student_data(min(100000, num_rows))
    num_rows -= 50000
    
    # Add index to inserted rows
    cursor.execute("SELECT COUNT(*) FROM students_data")
    count = cursor.fetchone()[0]
    for j in range(index, count+1):
        cursor.execute("UPDATE students_data SET id=%s WHERE id=%s", (j, j))
    index = count + 1

# Commit the changes
db.commit()

# Close the connection
db.close()

Enter the number of rows of student data to insert: 3500

Enter the number of rows of employee data to insert: 3500

In [1]:
import random
from faker import Faker
import mysql.connector

# Define the companies, designations, departments, degrees and specializations
companies = ["Amazon", "Facebook", "Myntra", "Qualitest", "Concentrix", "Convergies", "Accenture", "Tata", "TechMahindra", "CocaCola", "Pepsi_Co", "Google"]
designations = ["Manager", "Senior Manager", "Team Lead", "Project Lead", "Developer", "Senior Developer", "Data Scientist", "Sr_DataScientist", "DataAnalyst", "Executive"]
departments = ["HR", "Marketing", "Testing", "Developer", "Operations", "L&D"]
degrees = ["Bachelor of Science", "Bachelor of Arts", "Bachelor of Commerce","Bachelor of Technlogy" ]
specializations = ["Computer Science", "Economics", "Management", "Statistics", "Mathematics"]

# Connect to the database
db = mysql.connector.connect(
    host="localhost",
    user="root",
    password="12345",
    database="matta"
)

# Create a cursor
cursor = db.cursor()

# Drop the employee table if it exists
cursor.execute("DROP TABLE IF EXISTS employee")

# Create the employee table
cursor.execute("""
CREATE TABLE employee (
    idx INT NOT NULL AUTO_INCREMENT,
    name VARCHAR(255),
    emp_id VARCHAR(255) NOT NULL PRIMARY KEY,
    department VARCHAR(255),
    designation VARCHAR(255),
    company_name VARCHAR(255),
    degree VARCHAR(255),
    specialization VARCHAR(255),
    salary DECIMAL(10,2),
    tenure INT,
    ess_2019 DECIMAL(3,2),
    ess_2020 DECIMAL(3,2),
    ess_2021 DECIMAL(3,2),
    ess_2022 DECIMAL(3,2),
    INDEX(idx)
)
""")

# Function to insert employee data into the database
def insert_employee_data(num_rows):
    fake = Faker('en_IN')
    for i in range(num_rows):
        emp_id = 'E' + str(random.randint(10000, 99999))
        while True:
            # Check if the generated employee ID already exists in the database
            cursor.execute("SELECT emp_id FROM employee WHERE emp_id = %s", (emp_id,))
            result = cursor.fetchone()
            if result is None:
                # If the employee ID does not exist, break out of the loop
                break
            # If the employee ID already exists, generate a new one
            emp_id = 'E' + str(random.randint(10000, 99999))
        name = fake.name()
        department = random.choice(departments)
        designation = random.choice(designations)
        company_name = random.choice(companies)
        degree = random.choice(degrees)
        specialization = random.choice(specializations)
        salary = round(random.uniform(20000, 150000), 2)
        tenure = random.randint(1, 10)
        ess_2019 = round(random.uniform(3, 5), 2)
        ess_2020 = round(random.uniform(3, 5), 2)
        ess_2021 = round(random.uniform(3, 5), 2)
        ess_2022 = round(random.uniform(3, 5), 2)
        query = "INSERT INTO employee (name, emp_id, department, designation, company_name, degree, specialization, salary, tenure, ess_2019, ess_2020, ess_2021, ess_2022) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)"
        values = (name, emp_id, department, designation, company_name, degree, specialization, salary, tenure, ess_2019, ess_2020, ess_2021, ess_2022)
        cursor.execute(query, values)

# Get user input for number of rows to insert
num_rows = int(input("Enter the number of rows of employee data to insert: "))

# Insert employee data in batches of 1000 rows at a time
num_iterations = num_rows // 1000
if num_rows % 1000 != 0:
    num_iterations += 1

for i in range(num_iterations):
    insert_employee_data(min(1000, num_rows))
    num_rows -= 1000

# Commit the changes
db.commit()

# Close the connection
db.close()

Enter the number of rows of employee data to insert: 7500

In [9]:
import random
from faker import Faker
import mysql.connector

# Define the companies, designations, departments, degrees and specializations
companies = ["Amazon", "Facebook", "Myntra", "Qualitest", "Concentrix", "Convergies", "Accenture", "Tata", "TechMahindra", "CocaCola", "Pepsi_Co", "Google"]
degrees = ["Bachelor of Science", "Bachelor of Arts", "Bachelor of Commerce","Bachelor of Technology" ]
specializations = {
    "Bachelor of Science": ["Computer Science", "Mathematics", "Statistics"],
    "Bachelor of Arts": ["Economics", "Management"],
    "Bachelor of Commerce": ["Economics", "Management", "Statistics"],
    "Bachelor of Technology": ["Computer Science"]
}
designations = ["Manager", "Senior Manager", "Team Lead", "Project Lead", "Developer", "Senior Developer", "Data Scientist", "Sr_DataScientist", "DataAnalyst", "Executive"]
departments = ["HR", "Marketing", "Testing", "Developer", "Operations", "L&D"]

# Connect to the database
db = mysql.connector.connect(
    host="localhost",
    user="root",
    password="12345",
    database="matta"
)

# Create a cursor
cursor = db.cursor()

# Drop the employee table if it exists
cursor.execute("DROP TABLE IF EXISTS employee")

# Create the employee table
cursor.execute("""
CREATE TABLE employee (
    idx INT NOT NULL AUTO_INCREMENT,
    name VARCHAR(255),
    emp_id VARCHAR(255) NOT NULL PRIMARY KEY,
    department VARCHAR(255),
    designation VARCHAR(255),
    company_name VARCHAR(255),
    degree VARCHAR(255),
    specialization VARCHAR(255),
    salary DECIMAL(10,2),
    tenure INT,
    ess_2019 DECIMAL(3,2),
    ess_2020 DECIMAL(3,2),
    ess_2021 DECIMAL(3,2),
    ess_2022 DECIMAL(3,2),
    INDEX(idx)
)
""")

# Function to insert employee data into the database
def insert_employee_data(num_rows):
    fake = Faker('en_IN')
    for i in range(num_rows):
        emp_id = 'E' + str(random.randint(10000, 99999))
        while True:
            # Check if the generated employee ID already exists in the database
            cursor.execute("SELECT emp_id FROM employee WHERE emp_id = %s", (emp_id,))
            result = cursor.fetchone()
            if result is None:
                # If the employee ID does not exist, break out of the loop
                break
            # If the employee ID already exists, generate a new one
            emp_id = 'E' + str(random.randint(10000, 99999))
        name = fake.name()
        department = random.choice(departments)
        designation = random.choice(designations)
        company_name = random.choice(companies)
        degree = random.choice(degrees)
        
        if degree == "Bachelor of Technology":
            specialization = random.choice(specializations[degree])
            designation = random.choice(["Developer", "Senior Developer"])
            department = random.choice(["Testing", "Developer", "Operations"])
        else:
            specialization = random.choice(specializations[degree])
            department = random.choice(departments)
            
        salary = round(random.uniform(20000, 150000), 2)
        tenure = random.randint(1, 10)
        ess_2019 = round(random.uniform(3, 5), 2)
        ess_2020 = round(random.uniform(3, 5), 2)
        ess_2021 = round(random.uniform(3, 5), 2)
        ess_2022 = round(random.uniform(3, 5), 2)
        query = "INSERT INTO employee (name, emp_id, department, designation, company_name, degree, specialization, salary, tenure, ess_2019, ess_2020, ess_2021, ess_2022) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)"
        values = (name, emp_id, department, designation, company_name, degree, specialization, salary, tenure, ess_2019, ess_2020, ess_2021, ess_2022)
        cursor.execute(query, values)

# Get user input for number of rows to insert
num_rows = int(input("Enter the number of rows of employee data to insert: "))

# Insert employee data in batches of 1000 rows at a time
num_iterations = num_rows // 1000
if num_rows % 1000 != 0:
    num_iterations += 1

for i in range(num_iterations):
    insert_employee_data(min(1000, num_rows))
    num_rows -= 1000

# Commit the changes
db.commit()

# Close the connection
db.close()

Enter the number of rows of employee data to insert: 3500